In [1]:
import pandas as pd
from scripts import project_functions as pf

In [2]:
# Load data from National Names
national_df = pf.load_and_process_one('../../data/raw/national/NationalNames.csv')
# Load 4 parts of raw data on State Names
state_df = pf.load_and_process_many("../../data/raw/state")

In [3]:
national_df

             Name  Year Gender  Count
0            Mary  1910      F  22848
1           Helen  1910      F  10479
2        Margaret  1910      F   8226
3         Dorothy  1910      F   7318
4            Ruth  1910      F   7212
...           ...   ...    ...    ...
1736485    Zykeem  2014      M      5
1736486    Zymeer  2014      M      5
1736487   Zymiere  2014      M      5
1736488     Zyran  2014      M      5
1736489     Zyrin  2014      M      5

[1736490 rows x 4 columns]

In [4]:
state_df

             Name  Year Gender State  Count
0            Mary  1910      F    AK     14
1           Annie  1910      F    AK     12
2            Anna  1910      F    AK     10
3        Margaret  1910      F    AK      8
4           Helen  1910      F    AK      7
...           ...   ...    ...   ...    ...
5647421      Seth  2014      M    WY      5
5647422   Spencer  2014      M    WY      5
5647423      Tyce  2014      M    WY      5
5647424    Victor  2014      M    WY      5
5647425    Waylon  2014      M    WY      5

[5647426 rows x 5 columns]

In [8]:
pf.NORTH_EAST

['CT', 'DE', 'MA', 'MD', 'ME', 'NH', 'NJ', 'NY', 'PA', 'RI', 'VT']